nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso802/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: LPC802
package_id: LPC802M001JDH20
mcu_data: ksdk2_0
processor_version: 4.0.1
board: LPCXpresso802
pin_labels:
- {pin_num: '14', pin_signal: PIO0_8/ADC_5, label: 'CN5[7]/CN3[25]/CN6[4]/LD19/LD20/LD4/PB3/PIO0_8_RXD_User_GPIO2_LED1', identifier: LED_BLUE;User_PB3}
- {pin_num: '13', pin_signal: PIO0_9/ADC_4, label: 'CN5[8]/CN6[1]/CN3[28]/LD21/LD22/LD5/PIO0_9_TXD_GPIO1_LED2', identifier: LED_RED}
- {pin_num: '4', pin_signal: PIO0_12, label: 'CN4[4]/CN3[26]/CN3[24]/CN6[3]/CN9[1]/LD23/LD24/LD6/PB1/PIO0_12_ISP_GPIO0_LED3', identifier: LED_GREEN;ISP_PB1}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: 'CN4[6]/CN3[32]/PIO0_4_TXD_SCK', identifier: DEBUG_UART_TX}
- {pin_num: '19', pin_signal: PIO0_0/ACMP_I1, label: 'CN5[2]/CN3[31]/PIO0_0_RXD', identifier: DEBUG_UART_RX}
- {pin_num: '8', pin_signal: SWDIO/PIO0_2, label: 'CN2[2]/CN4[8]/U3[17]/PIO0_2_SWDIO', identifier: DEBUG_SWD_SWDIO}
- {pin_num: '7', pin_signal: SWCLK/PIO0_3, label: 'CN2[4]/CN4[7]/U3[16]/PIO0_3_SWCLK', identifier: DEBUG_SWD_SWCLK}
- {pin_num: '5', pin_signal: RESETN/PIO0_5, label: 'CN4[5]/CN2[10]/CN3[3]/U3[3]/U3[8]/PB2/PIO0_5_nRST', identifier: DEBUG_SWD_RESETN}
- {pin_num: '1', pin_signal: PIO0_16/ACMP_I4/ADC_3, label: 'CN4[1]/CN3[15]/CN7[1]/U7[2]/PIO0_16_SCL', identifier: I2C_SCL}
- {pin_num: '10', pin_signal: PIO0_10/ADC_7, label: 'CN4[10]/CN3[16]/CN7[2]/U7[1]/PIO0_10_SDA', identifier: I2C_SDA}
- {pin_num: '2', pin_signal: PIO0_17/ADC_9, label: 'CN4[2]/CN3[23]/CN9[2]/T2/IO0_17_PWM4_VDDIO'}
- {pin_num: '3', pin_signal: PIO0_13/ADC_10, label: 'CN4[3]/CN3[21]/U6[5]/PIO0_13_MOSI'}
- {pin_num: '9', pin_signal: PIO0_11/ADC_6/WKTCLKIN, label: 'CN4[9]/CN3[22]/U6[1]/PIO0_11_SPI_CS'}
- {pin_num: '11', pin_signal: PIO0_15/ADC_8, label: 'CN5[10]/CN3[9]/CN8[4]/RV1/PIO0_15_Ain0'}
- {pin_num: '12', pin_signal: PIO0_1/ADC_0/ACMP_I2/CLKIN, label: 'CN5[9]/CN3[20]/U6[2]/PIO0_1_MISO'}
- {pin_num: '17', pin_signal: PIO0_7/ADC_1/ACMPVREF, label: 'CN5[4]/CN3[27]/CN6[2]/LD17/LD18/PIO0_7_GPIO3'}
- {pin_num: '20', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'CN5[1]/U6[6]/PIO0_14_SCLK'}
- {pin_num: '18', pin_signal: VREFP, label: 'CN5[3]/CN3[17]/CN8[3]/RV1/JP2/M_VREF'}
- {pin_num: '15', pin_signal: VDD, label: 'CN5[6]/JP1/MCU_VDD'}
- {pin_num: '16', pin_signal: VSS, label: GND}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '14', peripheral: GPIO, signal: 'PIO0, 8', pin_signal: PIO0_8/ADC_5, identifier: LED_BLUE, direction: OUTPUT, mode: pullUp, invert: disabled, hysteresis: enabled,
    opendrain: disabled}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 9', pin_signal: PIO0_9/ADC_4, direction: OUTPUT, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled}
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12, identifier: LED_GREEN, direction: OUTPUT, mode: pullUp, invert: disabled, hysteresis: enabled,
    opendrain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDsPins(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);

    const uint32_t IOCON_INDEX_PIO0_9_config = (/* Selects pull-up function */
                                                IOCON_PIO_MODE_PULLUP |
                                                /* Enable hysteresis */
                                                IOCON_PIO_HYS_EN |
                                                /* Input not invert */
                                                IOCON_PIO_INV_DI |
                                                /* Disables Open-drain function */
                                                IOCON_PIO_OD_DI);
    /* PORT1 PIN3 (coords: ) is configured as  */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_9, IOCON_INDEX_PIO0_9_config);

